Процедура ОбработкаПроведения(Отказ, Режим)
	
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправленческийОстатки.Субконто2,
	|	УправленческийОстатки.Субконто3,
	|	УправленческийОстатки.СуммаРубОстаток
	|ПОМЕСТИТЬ ВремТ
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(&Дата, Счет = &Покупатели, &Субконто, Субконто1 = &Контрагент) КАК
	|		УправленческийОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТ.Субконто2 КАК Субконто2,
	|	ВремТ.Субконто3,
	|	ВремТ.СуммаРубОстаток КАК СуммаРубОстаток,
	|	КурсыВалютСрезПоследних.Курс
	|ИЗ
	|	ВремТ КАК ВремТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВремТ.Субконто3
	|			ИЗ
	|				ВремТ КАК ВремТ)) КАК КурсыВалютСрезПоследних
	|		ПО ВремТ.Субконто3 = КурсыВалютСрезПоследних.Валюта
	|ИТОГИ
	|	СУММА(СуммаРубОстаток)
	|ПО
	|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
	Субконто = новый массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагент);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договор);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Валюта);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Осталось = Сумма;
	ВыборкаДетальныеЗаписи.Следующий();
	Если ВыборкаДетальныеЗаписи.СуммаРубОстаток < Сумма Тогда
		Отказ=Истина;
		Сообщить("Сумма завышена. Надо = " + ВыборкаДетальныеЗаписи.СуммаРубОстаток);
	КонецЕсли;
	Если Не Отказ Тогда
		Пока Осталось > 0 И ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
			Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=Контрагент;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор]=ВыборкаДетальныеЗаписи.Субконто2;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Валюта]=ВыборкаДетальныеЗаписи.Субконто3;
			Движение.СуммаРубДт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток );
			Движение.СуммаРубКт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток );
			Движение.СуммаВалДт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток )/ВыборкаДетальныеЗаписи.Курс;
			Движение.СуммаВалКт = Мин(Осталось,ВыборкаДетальныеЗаписи.СуммаРубОстаток )/ВыборкаДетальныеЗаписи.Курс;
			Осталось=Осталось-Движение.СуммаРубДт;
		КонецЦикла;
	КонецЕсли;

	Движения.Управленческий.Записывать = Истина;
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры